const fishingData = {
  "鱼类数据": [
    {
      "类别": "水域鱼类",
      "鱼类": [
        {
          "名称": "跳跃玉鳍鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "蓝色布拉丁鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "紫罗兰阅诗者",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "文雅金鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "绯红沙舞者",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "深海公主",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "深渊凝视者",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "鼻涕虫",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "青蛙",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "粉色珊瑚",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "飞翔燃烧镖鱼",
          "稀有度": "普通",
          "出现条件/地点": "深渊世界，爬虫&鱿鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "燃烧克拉肯幼体",
          "稀有度": "普通",
          "出现条件/地点": "深渊世界，爬虫&鱿鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "和风鮟鱇鱼",
          "稀有度": "普通",
          "出现条件/地点": "深渊世界，青蛙&流浪鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "和风鹦鹉螺",
          "稀有度": "普通",
          "出现条件/地点": "深渊世界，青蛙&流浪鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "深渊鮟鱇鱼",
          "稀有度": "普通",
          "出现条件/地点": "深渊世界，珊瑚&元素的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "深渊甲壳",
          "稀有度": "普通",
          "出现条件/地点": "深渊世界，珊瑚&元素的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "大鲶鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "盐水剑鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "光辉鲨丁鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "附魔妖精鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "冻矿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "学士鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "光耀矿石鱼",
          "稀有度": "罕见",
          "出现条件/地点": "断裂高地上层",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "流浪鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "水元素",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "蓝色鱿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "毒性青苔石鱼",
          "稀有度": "罕见",
          "出现条件/地点": "深渊世界，爬虫&鱿鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "燃烧河豚",
          "稀有度": "罕见",
          "出现条件/地点": "深渊世界，爬虫&鱿鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "符文板鱼",
          "稀有度": "罕见",
          "出现条件/地点": "深渊世界，青蛙&流浪鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "和风蛤蜊",
          "稀有度": "罕见",
          "出现条件/地点": "深渊世界，青蛙&流浪鱼的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "深渊海马",
          "稀有度": "罕见",
          "出现条件/地点": "深渊世界，珊瑚&元素的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "深渊石鱼",
          "稀有度": "罕见",
          "出现条件/地点": "深渊世界，珊瑚&元素的水池",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "远古海鱼",
          "稀有度": "稀有",
          "出现条件/地点": "不满足其他稀有鱼条件的地方",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "宽眼笨鱼",
          "稀有度": "稀有",
          "出现条件/地点": "教程世界",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "光辉黄昏鱼",
          "稀有度": "稀有",
          "出现条件/地点": "光辉遗迹白天",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "光辉月鱼",
          "稀有度": "稀有",
          "出现条件/地点": "光辉遗迹黑天",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "薄暮鱼",
          "稀有度": "稀有",
          "出现条件/地点": "诅咒峡谷",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "奇怪鱼眼",
          "稀有度": "稀有",
          "出现条件/地点": "暗影塔大厅",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "主城鱼",
          "稀有度": "稀有",
          "出现条件/地点": "主城",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "枯骨鱼",
          "稀有度": "稀有",
          "出现条件/地点": "沙漠边境",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "彩虹鱼",
          "稀有度": "稀有",
          "出现条件/地点": "浸没世界：魔法环焦",
          "所需钓竿类型": "无",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "青蛙王子",
          "稀有度": "稀有",
          "出现条件/地点": "妖精森林，高度在20~255之间",
          "所需钓竿类型": "湖中仙女（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "稚鸡鱼",
          "稀有度": "稀有",
          "出现条件/地点": "龙火山峰，高度在20~255之间",
          "所需钓竿类型": "湖中仙女（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "女巫海葵鱼",
          "稀有度": "稀有",
          "出现条件/地点": "诅咒峡谷，高度在20~255之间",
          "所需钓竿类型": "湖中仙女（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "狮鹫鱼",
          "稀有度": "稀有",
          "出现条件/地点": "除了妖精森林、龙火山峰、诅咒峡谷，高度在200~255之间",
          "所需钓竿类型": "湖中仙女（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "深海怪鱼",
          "稀有度": "稀有",
          "出现条件/地点": "除了妖精森林、龙火山峰、诅咒峡谷，高度在1~20之间",
          "所需钓竿类型": "湖中仙女（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "水龟",
          "稀有度": "稀有",
          "出现条件/地点": "暗影海滩：禁忌之影",
          "所需钓竿类型": "海龟拖杆（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "鲨鱼",
          "稀有度": "稀有",
          "出现条件/地点": "无",
          "所需钓竿类型": "无",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "依偎虫",
          "稀有度": "稀有",
          "出现条件/地点": "暗影海滩/开放海域",
          "所需钓竿类型": "暗流印记商人钓竿（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "妮莎妖精鱼",
          "稀有度": "稀有",
          "出现条件/地点": "粉色珊瑚&水元素的水池",
          "所需钓竿类型": "暗流印记商人钓竿（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "燃烧果冻鱼",
          "稀有度": "稀有",
          "出现条件/地点": "深渊世界，鼻涕虫&鱿鱼的水池",
          "所需钓竿类型": "深渊钓竿（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "克拉肯幼体",
          "稀有度": "稀有",
          "出现条件/地点": "深渊世界，青蛙&流浪鱼的水池",
          "所需钓竿类型": "深渊钓竿（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "和风蝠鲼",
          "稀有度": "稀有",
          "出现条件/地点": "深渊世界，珊瑚&元素的水池",
          "所需钓竿类型": "深渊钓竿（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "深渊鱿鱼",
          "稀有度": "稀有",
          "出现条件/地点": "深渊世界，稀有鱼池",
          "所需钓竿类型": "深渊钓竿（使用）",
          "鱼池类型": "鱼池"
        }
      ]
    },
    {
      "类别": "熔岩鱼类",
      "鱼类": [
        {
          "名称": "骨火狂牙鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "炽热翻鳍鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "火熔等角虫",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "燃炎蛤蜊",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "舞龙鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "彩虹壳小海龟",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "影裔三叶虫",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "熔岩爬虫",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "红色青蛙",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "火焰珊瑚",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "塑形石矿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "蓝晶矿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "限晶矿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "火鼻矿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "岩浆枪鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "高压煤黑鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "玻璃瞪鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "灰烬裂矿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "断裂高地",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "熔化的流浪鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "火元素",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "火鱿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "远古岩浆骑士",
          "稀有度": "稀有",
          "出现条件/地点": "不满足其他稀有鱼条件的地方",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "火烤笨鱼",
          "稀有度": "稀有",
          "出现条件/地点": "新手教程",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "焦炎主城鱼",
          "稀有度": "稀有",
          "出现条件/地点": "主城",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "翱翔焰鱼",
          "稀有度": "稀有",
          "出现条件/地点": "光辉遗迹",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "热带火山鱼",
          "稀有度": "稀有",
          "出现条件/地点": "失落岛屿（仅限主世界）",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "寒火鱼",
          "稀有度": "稀有",
          "出现条件/地点": "永冻界",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "火红流鱼",
          "稀有度": "稀有",
          "出现条件/地点": "侏罗纪：蜥蜴沼泽",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "岩浆龟",
          "稀有度": "稀有",
          "出现条件/地点": "断裂高地",
          "所需钓竿类型": "海龟拖杆（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "姜鲨鱼",
          "稀有度": "稀有",
          "出现条件/地点": "无",
          "所需钓竿类型": "熔火岩浆筛（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "明瑞阳光鱼",
          "稀有度": "稀有",
          "出现条件/地点": "熔岩鱼池",
          "所需钓竿类型": "暗流印记商人吊杆（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "蓝爪船长",
          "稀有度": "稀有",
          "出现条件/地点": "稀有熔岩鱼池",
          "所需钓竿类型": "暗流印记商人吊杆（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "灼热虎鱼",
          "稀有度": "稀有",
          "出现条件/地点": "暗影海滩，一星副本顶部",
          "所需钓竿类型": "阿尔法垂钓者/艾莉西亚吊杆（使用）",
          "鱼池类型": "鱼池"
        }
      ]
    },
    {
      "类别": "巧克力鱼类",
      "鱼类": [
        {
          "名称": "薄荷巧克力龟",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "蓝莓派虎鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "原始紫红刺鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "橙色马林克鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "樱桃果冻鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "酸溜鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "暗礁烈鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "糖果爬虫",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "糖果蛙",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "糖果珊瑚",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "纸杯蛋糕爬行鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "巧克力鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "糖盖糊鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "甜蜜斩鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "肥大布朗尼莫鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "红矿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "蓬丘仙境：远古高地",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "冰糖流浪鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "巧克力元素",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "糖果鱿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "远古巧克鮟鱇",
          "稀有度": "稀有",
          "出现条件/地点": "不满足其他稀有鱼条件的地方",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "蓝色棉花糖高飞鱼",
          "稀有度": "稀有",
          "出现条件/地点": "任意世界，高度在200~255之间",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "粉色棉花糖高飞鱼",
          "稀有度": "稀有",
          "出现条件/地点": "任意世界，高度在200~255之间",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "增压块鱼",
          "稀有度": "稀有",
          "出现条件/地点": "除了主城外的世界，高度在1~20之间",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "热门巧克力章鱼",
          "稀有度": "稀有",
          "出现条件/地点": "侏罗纪：蜥蜴沼泽",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "巧克鳄鱼",
          "稀有度": "稀有",
          "出现条件/地点": "糖果世界，高度在20~200之间",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "软糖鱼",
          "稀有度": "稀有",
          "出现条件/地点": "蓬丘仙境：远古高地",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "巧克力龟",
          "稀有度": "稀有",
          "出现条件/地点": "永冻界，高度在1~20之间",
          "所需钓竿类型": "海龟拖杆（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "巧克力鲨鱼",
          "稀有度": "稀有",
          "出现条件/地点": "无",
          "所需钓竿类型": "蘸糖钓杖（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "松饼海胆",
          "稀有度": "稀有",
          "出现条件/地点": "糖果蛙&冰糖流浪鱼的巧克力池",
          "所需钓竿类型": "暗流印记商人钓竿（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "激升河豚",
          "稀有度": "稀有",
          "出现条件/地点": "暗影海滩，一星副本顶部",
          "所需钓竿类型": "阿尔法垂钓者/艾莉西亚钓竿（使用）",
          "鱼池类型": "鱼池"
        }
      ]
    },
    {
      "类别": "等离子鱼类",
      "鱼类": [
        {
          "名称": "翡翠霓虹镖鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "冷钢外骨骼鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "紫色霓虹射线",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "青钢霓虹石首鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "卡明提蟹",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "楷模八爪鱼",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "暗影垂钓者",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "发光的鼻涕虫",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "灯光青蛙",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "发光珊瑚",
          "稀有度": "普通",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "封闭贝塔鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "故障的阿尔法鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "太字节龟",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "霓虹无限鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "硝基闪光鱼",
          "稀有度": "罕见",
          "出现条件/地点": "晶洞高层地表",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "LED流浪鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "等离子元素",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "萤火鱿鱼",
          "稀有度": "罕见",
          "出现条件/地点": "无",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "LED狮子鱼",
          "稀有度": "稀有",
          "出现条件/地点": "蓬丘仙境：远古高地",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "电鳗",
          "稀有度": "稀有",
          "出现条件/地点": "任何世界，高度在1~55之间",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "石化河豚",
          "稀有度": "稀有",
          "出现条件/地点": "任何世界，高度在111~255之间",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "质子水虎鱼",
          "稀有度": "稀有",
          "出现条件/地点": "霓虹城，高度在55~111之间",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "章鱼无人机",
          "稀有度": "稀有",
          "出现条件/地点": "暗影塔大厅",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "霓虹骑士鱼",
          "稀有度": "稀有",
          "出现条件/地点": "不满足其他稀有鱼条件的地方，高度在56~110之间",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "等离子冷凝鱼",
          "稀有度": "稀有",
          "出现条件/地点": "永冻界",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "等离子龟",
          "稀有度": "稀有",
          "出现条件/地点": "永冻界",
          "所需钓竿类型": "海龟拖杆（使用）",
          "鱼池类型": "非鱼池"
        },
        {
          "名称": "震动鲨鱼MK.II",
          "稀有度": "稀有",
          "出现条件/地点": "永冻界",
          "所需钓竿类型": "N-0深钓竿（拥有即可）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "伊维斯鳗鱼",
          "稀有度": "稀有",
          "出现条件/地点": "永冻界",
          "所需钓竿类型": "暗流印记商人钓竿（使用）",
          "鱼池类型": "鱼池"
        },
        {
          "名称": "脉冲反应鱼",
          "稀有度": "稀有",
          "出现条件/地点": "永冻界",
          "所需钓竿类型": "阿尔法垂钓者/艾莉西亚钓竿（使用）",
          "鱼池类型": "鱼池"
        }
      ]
    }
  ]
}